potential_topics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-18 So 13:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Hugs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="stylesheet.css"
</head>
<body>
<div id="preamble" class="status">
<!-- MailerLite Universal -->
<script>
    (function(w,d,e,u,f,l,n){w[f]=w[f]||function(){(w[f].q=w[f].q||[])
    .push(arguments);},l=d.createElement(e),l.async=1,l.src=u,
    n=d.getElementsByTagName(e)[0],n.parentNode.insertBefore(l,n);})
    (window,document,'script','https://assets.mailerlite.com/js/universal.js','ml');
    ml('account', '919123');
</script>
<!-- End MailerLite Universal -->
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1aa3225">likelihood, bayes, and least-squares regression</a>
<ul>
<li><a href="#orgf4dbf00">Likelihood v.s. Probability</a></li>
<li><a href="#org7d668ca">Linear regression for probability</a></li>
<li><a href="#orgadb25ec">Maximum likelihood</a></li>
<li><a href="#org567caea">Bayes' rule: (insert intuitive title here)</a></li>
<li><a href="#orgdc69b2a">Maximum probability</a></li>
<li><a href="#orgb53ee41">least-squares regression implements bayesian inference</a></li>
</ul>
</li>
<li><a href="#org52e8e70">explaining predictive coding</a>
<ul>
<li><a href="#org4c17417">what is predictive coding?</a></li>
<li><a href="#orga8d00e5">why is it exciting?: Bayesian Brain</a></li>
<li><a href="#org4ec2d3b">what's the evidence?</a></li>
</ul>
</li>
<li><a href="#org0231978">strengths and limitations of falsificationism</a>
<ul>
<li><a href="#orgefe5d88">naive falsificationism</a></li>
<li><a href="#org160a08f">what problems does it solve?</a></li>
<li><a href="#org535b6f5">why did my bridge collapse?</a></li>
<li><a href="#org531045b">the problem of holism</a></li>
<li><a href="#orgf3aba33">For everyday reasoning&#x2026;</a></li>
</ul>
</li>
<li><a href="#orga05d9cb">strengths and limitations of bayesianist epistemology</a>
<ul>
<li><a href="#org65ebbaf">refresher: Bayes' rule</a></li>
<li><a href="#orgcce50c4">Bayesian epistemology</a></li>
<li><a href="#org0b1cb22">common criticisms</a></li>
<li><a href="#org7003535">ain't nobody got time for that</a></li>
</ul>
</li>
<li><a href="#org01e5edf">reductionism and holism in computational modeling</a></li>
<li><a href="#orgd7af5c1">Software is magic: designing software modules</a>
<ul>
<li><a href="#org8bb6cf8">engineers benefit from design practices too</a></li>
<li><a href="#orgcc4368e">how this applies to science?</a></li>
<li><a href="#org58e28cb">applies to science communication?</a></li>
<li><a href="#org159ddc1">research to do:</a>
<ul>
<li><a href="#orgc2a748a">find some passages of 'the inmates are running the asylum'</a></li>
<li><a href="#org7754bba">find some relevant passages from liskov</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb3893e5">parallels between test driven development and the scientific method</a>
<ul>
<li><a href="#orgf096bbb">TDD - test driven development</a></li>
<li><a href="#org24f782e">theory, experiment, revised theory</a></li>
<li><a href="#orga1ceb63">Parallels</a></li>
<li><a href="#orga98ecb2">The the goals of computational models are no different from any other software, and so we should apply those practices</a></li>
<li><a href="#orgafab372">specialization and comminication</a></li>
<li><a href="#orgcafb39c">the problem of holism</a></li>
<li><a href="#org1e864bc">preventing regressions</a></li>
<li><a href="#org0a5eb0c">black-box testing v.s. implementation testing</a></li>
<li><a href="#orgfa8791e">specification</a></li>
</ul>
</li>
<li><a href="#org5675c73">Scientists: write code properly please</a>
<ul>
<li><a href="#org51e02be">scientific models are non-trivial</a></li>
<li><a href="#orge17640f">analysis is sometimes non-trivial</a></li>
<li><a href="#org8635731">time pressure, deadlines, preliminary results, exploratory analysis</a></li>
<li><a href="#orgdc3885d">a possible solution: prototyping</a></li>
</ul>
</li>
<li><a href="#orge8e0d59">layered-sprites: gamedev for the artistically challenged</a></li>
<li><a href="#org148947e">Short story: Happy Automata</a></li>
<li><a href="#orgd4621fe">first sight and second thoughts: epistemology of the Tiffany Aching series</a>
<ul>
<li><a href="#org5f69085">first sight: empiricism</a></li>
<li><a href="#orgcee5e77">second thoughts: rationalism</a></li>
<li><a href="#org9223e60">third thoughts: willingness to question(??? &#x2026; philosophy, postmodernism)</a></li>
<li><a href="#orgac51c02">research to do:</a>
<ul>
<li><a href="#orgaf231d8">re-read aching books</a></li>
<li><a href="#orgb4f403d">read some review of aching books</a></li>
<li><a href="#orgf5d840b">read some more discworld reviews/analyses</a></li>
<li><a href="#org8f4dcbb">re-read theory and reality</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org089b7fa">the necessity of meaning</a>
<ul>
<li><a href="#org4df7e14">to live is to act, acting requires meaning (or value)</a></li>
<li><a href="#org5e55e5b">Accepting Induction</a>
<ul>
<li><a href="#org749e496">induction is necessary to learn about the world and act in it</a></li>
</ul>
</li>
<li><a href="#org8046043">Accepting Logic</a>
<ul>
<li><a href="#orge5cbe75">logic is necessary to learn about the world and act in it</a></li>
</ul>
</li>
<li><a href="#org38fec67">Accepting Meaning</a>
<ul>
<li><a href="#org0aab115">value is necessary to learn about the world and act in it</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1856e9d">learned helplessness in various contexts</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1aa3225" class="outline-2">
<h2 id="org1aa3225">likelihood, bayes, and least-squares regression</h2>
<div class="outline-text-2" id="text-org1aa3225">
</div>
<div id="outline-container-orgf4dbf00" class="outline-3">
<h3 id="orgf4dbf00">Likelihood v.s. Probability</h3>
</div>
<div id="outline-container-org7d668ca" class="outline-3">
<h3 id="org7d668ca">Linear regression for probability</h3>
</div>
<div id="outline-container-orgadb25ec" class="outline-3">
<h3 id="orgadb25ec">Maximum likelihood</h3>
</div>
<div id="outline-container-org567caea" class="outline-3">
<h3 id="org567caea">Bayes' rule: (insert intuitive title here)</h3>
</div>
<div id="outline-container-orgdc69b2a" class="outline-3">
<h3 id="orgdc69b2a">Maximum probability</h3>
</div>
<div id="outline-container-orgb53ee41" class="outline-3">
<h3 id="orgb53ee41">least-squares regression implements bayesian inference</h3>
</div>
</div>
<div id="outline-container-org52e8e70" class="outline-2">
<h2 id="org52e8e70">explaining predictive coding</h2>
<div class="outline-text-2" id="text-org52e8e70">
</div>
<div id="outline-container-org4c17417" class="outline-3">
<h3 id="org4c17417">what is predictive coding?</h3>
</div>
<div id="outline-container-orga8d00e5" class="outline-3">
<h3 id="orga8d00e5">why is it exciting?: Bayesian Brain</h3>
</div>
<div id="outline-container-org4ec2d3b" class="outline-3">
<h3 id="org4ec2d3b">what's the evidence?</h3>
</div>
</div>
<div id="outline-container-org0231978" class="outline-2">
<h2 id="org0231978">strengths and limitations of falsificationism</h2>
<div class="outline-text-2" id="text-org0231978">
</div>
<div id="outline-container-orgefe5d88" class="outline-3">
<h3 id="orgefe5d88">naive falsificationism</h3>
</div>
<div id="outline-container-org160a08f" class="outline-3">
<h3 id="org160a08f">what problems does it solve?</h3>
</div>
<div id="outline-container-org535b6f5" class="outline-3">
<h3 id="org535b6f5">why did my bridge collapse?</h3>
</div>
<div id="outline-container-org531045b" class="outline-3">
<h3 id="org531045b">the problem of holism</h3>
</div>
<div id="outline-container-orgf3aba33" class="outline-3">
<h3 id="orgf3aba33">For everyday reasoning&#x2026;</h3>
</div>
</div>
<div id="outline-container-orga05d9cb" class="outline-2">
<h2 id="orga05d9cb">strengths and limitations of bayesianist epistemology</h2>
<div class="outline-text-2" id="text-orga05d9cb">
</div>
<div id="outline-container-org65ebbaf" class="outline-3">
<h3 id="org65ebbaf">refresher: Bayes' rule</h3>
</div>
<div id="outline-container-orgcce50c4" class="outline-3">
<h3 id="orgcce50c4">Bayesian epistemology</h3>
</div>
<div id="outline-container-org0b1cb22" class="outline-3">
<h3 id="org0b1cb22">common criticisms</h3>
</div>
<div id="outline-container-org7003535" class="outline-3">
<h3 id="org7003535">ain't nobody got time for that</h3>
</div>
</div>
<div id="outline-container-org01e5edf" class="outline-2">
<h2 id="org01e5edf">reductionism and holism in computational modeling</h2>
</div>

<div id="outline-container-orgd7af5c1" class="outline-2">
<h2 id="orgd7af5c1">Software is magic: designing software modules</h2>
<div class="outline-text-2" id="text-orgd7af5c1">
</div>
<div id="outline-container-org8bb6cf8" class="outline-3">
<h3 id="org8bb6cf8">engineers benefit from design practices too</h3>
</div>
<div id="outline-container-orgcc4368e" class="outline-3">
<h3 id="orgcc4368e">how this applies to science?</h3>
</div>
<div id="outline-container-org58e28cb" class="outline-3">
<h3 id="org58e28cb">applies to science communication?</h3>
</div>
<div id="outline-container-org159ddc1" class="outline-3">
<h3 id="org159ddc1">research to do:</h3>
<div class="outline-text-3" id="text-org159ddc1">
</div>
<div id="outline-container-orgc2a748a" class="outline-4">
<h4 id="orgc2a748a">find some passages of 'the inmates are running the asylum'</h4>
</div>
<div id="outline-container-org7754bba" class="outline-4">
<h4 id="org7754bba">find some relevant passages from liskov</h4>
</div>
</div>
</div>

<div id="outline-container-orgb3893e5" class="outline-2">
<h2 id="orgb3893e5">parallels between test driven development and the scientific method</h2>
<div class="outline-text-2" id="text-orgb3893e5">
</div>
<div id="outline-container-orgf096bbb" class="outline-3">
<h3 id="orgf096bbb">TDD - test driven development</h3>
<div class="outline-text-3" id="text-orgf096bbb">
<p>
Test Driven Development is a strategy for developing software that goes something like this:
</p>
<ol class="org-ol">
<li>Write a test to check that your software does the right thing under particular circumstances</li>
<li>Run the test - it should fail the first time since you haven't modified the software itself yet</li>
<li>Update the software until the test runs</li>
</ol>

<p>
If you're writing any moderate/large software, you will want to have a bunch of tests that you can run at
any time to check that all its parts are still working. TDD just means writing a test before you write the
code to make it happen. My points in this post would apply to a code-then-test paradigm as well, but why would you do it that way? 
</p>
</div>
</div>
<div id="outline-container-org24f782e" class="outline-3">
<h3 id="org24f782e">theory, experiment, revised theory</h3>
<div class="outline-text-3" id="text-org24f782e">
<p>
The requirements of software are that its behavior should match the desired behavior under as large a set of circumstances as possible.
</p>
</div>
</div>

<div id="outline-container-orga1ceb63" class="outline-3">
<h3 id="orga1ceb63">Parallels</h3>
<div class="outline-text-3" id="text-orga1ceb63">
<p>
Of course, these steps don't quite line up
</p>
</div>
</div>
<div id="outline-container-orga98ecb2" class="outline-3">
<h3 id="orga98ecb2">The the goals of computational models are no different from any other software, and so we should apply those practices</h3>
</div>
<div id="outline-container-orgafab372" class="outline-3">
<h3 id="orgafab372">specialization and comminication</h3>
</div>
<div id="outline-container-orgcafb39c" class="outline-3">
<h3 id="orgcafb39c">the problem of holism</h3>
</div>
<div id="outline-container-org1e864bc" class="outline-3">
<h3 id="org1e864bc">preventing regressions</h3>
</div>
<div id="outline-container-org0a5eb0c" class="outline-3">
<h3 id="org0a5eb0c">black-box testing v.s. implementation testing</h3>
</div>
<div id="outline-container-orgfa8791e" class="outline-3">
<h3 id="orgfa8791e">specification</h3>
</div>
</div>
<div id="outline-container-org5675c73" class="outline-2">
<h2 id="org5675c73">Scientists: write code properly please</h2>
<div class="outline-text-2" id="text-org5675c73">
</div>
<div id="outline-container-org51e02be" class="outline-3">
<h3 id="org51e02be">scientific models are non-trivial</h3>
</div>
<div id="outline-container-orge17640f" class="outline-3">
<h3 id="orge17640f">analysis is sometimes non-trivial</h3>
</div>
<div id="outline-container-org8635731" class="outline-3">
<h3 id="org8635731">time pressure, deadlines, preliminary results, exploratory analysis</h3>
</div>
<div id="outline-container-orgdc3885d" class="outline-3">
<h3 id="orgdc3885d">a possible solution: prototyping</h3>
</div>
</div>
<div id="outline-container-orge8e0d59" class="outline-2">
<h2 id="orge8e0d59">layered-sprites: gamedev for the artistically challenged</h2>
</div>

<div id="outline-container-org148947e" class="outline-2">
<h2 id="org148947e">Short story: Happy Automata</h2>
</div>
<div id="outline-container-orgd4621fe" class="outline-2">
<h2 id="orgd4621fe">first sight and second thoughts: epistemology of the Tiffany Aching series</h2>
<div class="outline-text-2" id="text-orgd4621fe">
</div>
<div id="outline-container-org5f69085" class="outline-3">
<h3 id="org5f69085">first sight: empiricism</h3>
</div>
<div id="outline-container-orgcee5e77" class="outline-3">
<h3 id="orgcee5e77">second thoughts: rationalism</h3>
</div>
<div id="outline-container-org9223e60" class="outline-3">
<h3 id="org9223e60">third thoughts: willingness to question(??? &#x2026; philosophy, postmodernism)</h3>
</div>
<div id="outline-container-orgac51c02" class="outline-3">
<h3 id="orgac51c02">research to do:</h3>
<div class="outline-text-3" id="text-orgac51c02">
</div>
<div id="outline-container-orgaf231d8" class="outline-4">
<h4 id="orgaf231d8">re-read aching books</h4>
</div>
<div id="outline-container-orgb4f403d" class="outline-4">
<h4 id="orgb4f403d">read some review of aching books</h4>
</div>
<div id="outline-container-orgf5d840b" class="outline-4">
<h4 id="orgf5d840b">read some more discworld reviews/analyses</h4>
</div>
<div id="outline-container-org8f4dcbb" class="outline-4">
<h4 id="org8f4dcbb">re-read theory and reality</h4>
</div>
</div>
</div>
<div id="outline-container-org089b7fa" class="outline-2">
<h2 id="org089b7fa">the necessity of meaning</h2>
<div class="outline-text-2" id="text-org089b7fa">
</div>
<div id="outline-container-org4df7e14" class="outline-3">
<h3 id="org4df7e14">to live is to act, acting requires meaning (or value)</h3>
</div>
<div id="outline-container-org5e55e5b" class="outline-3">
<h3 id="org5e55e5b">Accepting Induction</h3>
<div class="outline-text-3" id="text-org5e55e5b">
</div>
<div id="outline-container-org749e496" class="outline-4">
<h4 id="org749e496">induction is necessary to learn about the world and act in it</h4>
</div>
</div>
<div id="outline-container-org8046043" class="outline-3">
<h3 id="org8046043">Accepting Logic</h3>
<div class="outline-text-3" id="text-org8046043">
</div>
<div id="outline-container-orge5cbe75" class="outline-4">
<h4 id="orge5cbe75">logic is necessary to learn about the world and act in it</h4>
</div>
</div>
<div id="outline-container-org38fec67" class="outline-3">
<h3 id="org38fec67">Accepting Meaning</h3>
<div class="outline-text-3" id="text-org38fec67">
</div>
<div id="outline-container-org0aab115" class="outline-4">
<h4 id="org0aab115">value is necessary to learn about the world and act in it</h4>
</div>
</div>
</div>
<div id="outline-container-org1856e9d" class="outline-2">
<h2 id="org1856e9d">learned helplessness in various contexts</h2>
</div>
</div>
<div id="postamble" class="status">
<div class="ml-embedded" data-form="UcmPfz"></div>
       <script src="https://utteranc.es/client.js"
        repo="HDictus/HDictus.github.io"
        issue-term="title"
        theme="github-light"
        crossorigin="anonymous"
        async>
      </script>

      <a href="index.html"> home </a>
</div>
</body>
</html>